import "./style.css";

const myData = [
  {
    title: "ChatGPT",
    desc: "Великий і могутній. Це найпопулярніший інструмент, яким користується 82% практиків українського бізнесу. Його ключова перевага в тому, що він був першим загальнодоступним сервісом, який з’явився спочатку на міжнародному, а потім і на локальному рівнях. Модель GPT була протестована сотні тисяч разів у різноманітних сценаріях, що дало змогу оптимізувати її та створити багато корисних плагінів.<br /> Наталія Устименко, Head of Direct Marketing в eSputnik.com, стверджує, що в ChatGPT, на відміну від авторів, ніколи не зникають натхнення й креативність. Вона вважає застосунок «універсалом», здатним підхопити будь-яку роботу: «Переваги зрозумілі: з сервісом досить легко брейнштормити та опрацьовувати різні варіанти текстів, тем, заголовків. Економія часу на перекладах, вичитуванні та підготовці однотипних листів». Що ж до мінусів ChatGPT думки експертів розходяться. Одні вважають, що штучний інтелект занадто галюцинує і володіє письменницькою майстерністю на рівні учня 3 класу. Інші вважають, що всі проблеми — від недостатньо точно поставленого завдання. Один зі спеціалістів сказав, що для створення якісних текстів з першої спроби потрібен промпт завдовжки 300–500 слів. Для розробки ідеальної схеми запитів його компанії знадобилось кілька місяців. Ще 6% активно користуються API OpenAI, інтегруючи його у власні застосунки. Це оптимальний підхід для великого бізнесу, який значно підвищує продуктивність роботи всіх відділів компанії. 4% експертів назвали AIRPM і HARPA AI, які пропонують величезну колекцію готових промптів, своїми улюбленими плагінами для штучного інтелекту. ",
    urls: ["https://th.bing.com/th/id/OIP.5Rhx2s13CMI3XDpXuNQyDQHaEg?rs=1&pid=ImgDetMain", "https://www.enmilocalfunciona.io/content/images/2023/03/image-34.png"],
  },
  {
    title: "Google Bard",
    desc: "Відносно молодий гравець з амбіціями лідера та «дитячими болячками». Цю генеративну модель вибирають спеціалісти, яким потрібно працювати з новими даними та отримувати інформацію з мінімальними затримками. Нагадаємо, що база ChatGPT датується вереснем 2021 року, тоді як Google Bard може користуватися пошуковою системою для обробки свіжих матеріалів.Ярослав Вепрев, strategist, marketer, eCommerce expert, активно використовує цей штучний інтелект у своїй роботі. Він надав нам вичерпний перелік переваг і недоліків цього інструмента:«Головна перевага — наявність виходу в інтернет, він може шукати й використовувати актуальну інформацію, дає кілька варіантів відповіді на вибір. Але погано розуміє великі інструкції, тому промпти краще давати поетапно. А ще частіше вигадує неправдиву інформацію, ніж ChatGPT».Доступ до пошукової системи — водночас найбільший плюс і мінус Google Bard. Інструмент здатен «підтягувати» свіжу інформацію, але це призводить до того, що він починає плутатися в даних і помилятися. Варто згадати тільки інцидент на його презентації, коли ШІ осоромив розробників, давши відверто неправильну відповідь на запитання. Але на думку Павла Герасимова, SEO Team Lead в Innovation Group, галюцинації штучного інтелекту — менша проблема, ніж помилки, спричинені людським фактором. «Тексти, отримані від ШІ, є високоякісними та унікальними. Але ключ до успіху в роботі з ШІ полягає у детальній підготовці завдань: що докладніше ви формулюєте завдання, то кращий результат отримаєте. ШІ – це потужний інструмент, який потребує осмисленого та креативного підходу для отримання оптимальних результатів».Важливо пам’ятати, що до Google Bard потрібен специфічний підхід. Промпти, створені для ChatGPT, тут працюватимуть не так ефективно. Якщо ви комбінуєте кілька інструментів, експерти радять знайти для кожного з них певну сферу застосування.  ",
    urls: ["https://th.bing.com/th/id/OIP.foscNWQl0wat4Lc_xRdIMgHaEK?rs=1&pid=ImgDetMain", "https://img.etimg.com/photo/msid-98906305/bard2.jpg"],
  },
  {
    title: "Jasper.AI",
    desc: "Популярний сервіс, яким користується 14% учасників нашого опитування. Він заснований на моделі GPT і нещодавно перейшов на актуальну четверту генерацію штучного інтелекту. Ірина Онищенко, Content Writer у Brainstack, дає йому просту, але дуже інформативну характеристику«По факту, це той самий чат, але загорнутий у красивий та зручний UI. Він полегшує роботу, бо в його командах уже є прописані промпти, тому на це не треба витрачати час і думати, як краще надати ШІ інформацію, щоб він її правильно опрацював».На відміну від ChatGPT, Jasper адаптовано до виконання маркетингових задач. За відгуками експертів, він краще справляється з неймінгом, написанням текстів для банерів і генерацією карток товарів. У нього є вбудовані модулі для перефразування, перевірки унікальності та виправлення граматичних помилок. Стандартна підписка навіть надає доступ до нейронної мережі Jasper Art, здатної створювати прості зображення на запит. ",
    urls: ["https://th.bing.com/th/id/OIP.9I1vGoCqUICnSw3I8gakggAAAA?rs=1&pid=ImgDetMain", "https://th.bing.com/th/id/OIP.xCe-BoOxo4HcGLKeNDuTUgHaD_?rs=1&pid=ImgDetMain"],
  },
  {
    title: "Microsoft Bing Chat",
    desc: "Цей інструмент тривалий час тестувався у закритому режимі, тому залишається відносно маловідомим. Хоча після відкриття доступу до нього ситуація вже встигла змінитися — з цією платформою працюють 14% опитаних нами експертів.Фактично, Bing Chat — це той самий GPT-4, тільки з іншими базовими налаштуваннями та більш зручним графічним інтерфейсом. Але, попри спорідненість двох інструментів, саме він заслуговує вищі оцінки спеціалістів. Наприклад, Єгор Брюханов, co-owner та маркетолог у Corns Agency, дає такий відгук:«Усі ШІ роблять більш-менш одне й те саме, та жоден із них не надав мені задовільного результату, навіть на сильно лімітованій версії, що й відбило бажання навіть пробувати розкривати всі їхні можливості. Все змінилося, коли я потрапив до закритого тесту ШІ чат-бота від Microsoft Bing (так, я знаю що це розумний пошуковик із функцією чат-бота, але то вже деталі)».Єгор стверджує, що саме Bing дав змогу його компанії удвічі збільшити кількість активних клієнтів та суттєво підвищити продуктивність кожного співробітника. Для нього ШІ — це не просто помічник, а партнер, який бере активну участь у розробці ефективної маркетингової політики. Серед мінусів Bing — слабка послідовна пам’ять. Якщо ChatGPT і Jasper зберігають первинні налаштування до останнього запиту, то цьому сервісу потрібні регулярні нагадування. ",
    urls: ["https://th.bing.com/th/id/OIP.MBzoXb4bNi2eVxx7kprZBAHaEK?rs=1&pid=ImgDetMain", "https://www.headshotreviews.com/wp-content/uploads/2023/08/Bing-AI-coming-to-Chrome-and-Safari-in-mobile.webp"],
  },
  {
    title: "Notion AI",
    desc: "Цією платформою користуються близько 10% опитаних нами спеціалістів. Хоча вона має спільне ядро зі своїми популярними конкурентами, її розробники витратили більше часу на роботу над промптами та модулями для розв’язання типових задач.Альона Гордієнко, Head of SEO у Firelink, дає таку характеристику цьому сервісу:«Notion — кльовий. Уміє не лише генерити. Круто перетворює тексти і таблички в html, якщо це необхідно для певних адмінок».Штучний інтелект автоматизує бюрократичну роботу. З його допомогою можна перетворювати масиви цифр і слів на готові таблички, наприклад бюджети, кошториси,  плани. Це ідеальний помічник менеджера, який підвищує продуктивність комунікації і з клієнтом, і з керівництвом компанії. ",
    urls: ["https://th.bing.com/th/id/OIP.DmoFbT5lfBJyLRi_uYmJhAHaEK?rs=1&pid=ImgDetMain", "https://static1.makeuseofimages.com/wordpress/wp-content/uploads/2023/02/upgrade-notion-ai.jpg"],
  },
];

const aiContainer = document.querySelector(".js-best-ai-container");
const loadeMoreBtn = document.querySelector(".js-load-more-btn");
let isListVisible = false; // Додайте змінну для відстеження стану списку

loadeMoreBtn.addEventListener("click", () => {
  if (isListVisible) {
    const { title, desc, urls } = myData[0];
    aiContainer.innerHTML = cardMarkup(0, title, desc, urls);

    isListVisible = false; // Оновіть стан
    loadeMoreBtn.textContent = "Показати всі";
    aiContainer.parentElement.scrollIntoView({
      behavior: "smooth",
      block: "start",
    });
  } else {
    aiContainer.innerHTML = myData
      .map(({ title, desc, urls }, id) => cardMarkup(id, title, desc, urls))
      .join(""); // Прихований список показується
    isListVisible = true; // Оновіть стан
    loadeMoreBtn.textContent = "Приховати список";
  }
});

function cardMarkup(id, title, desc, urls) {
  return `<li class="bestAI__card border-wraper">
    <p class="bestAI__card-number">0${id + 1}</p>
    <h3 class="bestAI__card-title h3-title">${title}</h3>
    <p class="bestAI__card-desc">
      ${desc}
    </p>
    <ul class="bestAI__card-img-list">
     ${urls.map(
       (url) => `<li class="bestAI__card-img-item">
        <img
        src="${url}"
        class="bestAI__card-img-img"
        />
   </li>`
     ).join("")}      
    </ul>
  </li>`;
}

const { title, desc, urls } = myData[0];
aiContainer.innerHTML = cardMarkup(0, title, desc, urls);

isListVisible = false; // Оновіть стан
loadeMoreBtn.textContent = "Показати всі";
